# Data Frames

## Collection of Series is called Data Frames

## 1.  Syntax For DataFrames Using Dictionary
## pd.DataFrames(data)

## 2.  Syntax For DataFrames Using List
## pd.DataFrames(data, column=headers)

In [16]:
import numpy as np
import pandas as pd

## DataFrames In Pandas Using Dictionary With a Single Series

In [18]:
my_list = {1:[11],2:[12],3:[13],4:[14]}
df1 = pd.DataFrame(my_list)
df1

    1   2   3   4
0  11  12  13  14

## Data Frames Using Dictionary with Multiple Key : Value Pairs (Multiple Series)

In [13]:
data = {
    'Name': ['Tom', 'nick', 'krish', 'jack'],
    'Age': [20, 21, 19, 18],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 80000, 65000, 72000]
    }
df2 = pd.DataFrame(data)
df2

    Name  Age         City  Salary
0    Tom   20     New York   70000
1   nick   21  Los Angeles   80000
2  krish   19      Chicago   65000
3   jack   18      Houston   72000

## DataFrame in Pandas using List , without giving any Column (HEADERS) values

In [14]:
dlist = [
    ['john', 28, 'New York', 65000],
    ['anna', 22, 'London', 72000],
    ['peter', 34, 'Berlin', 52000]
]

df3 = pd.DataFrame(dlist)
df3

       0   1         2      3
0   john  28  New York  65000
1   anna  22    London  72000
2  peter  34    Berlin  52000

## Using Custom Columns (HEADERS)

In [19]:
df4 = pd.DataFrame(dlist, columns=['Name', 'Age', 'City', 'Salary'])
df4

    Name  Age      City  Salary
0   john   28  New York   65000
1   anna   22    London   72000
2  peter   34    Berlin   52000